# Remove Duplicates

In [1]:
import pandas as pd

df = pd.read_csv('sources/cupcake_duplicates.csv')
df.head()

      Mese  Cupcake
0  2004-01        5
1  2004-01        5
2  2004-01        5
3  2004-02        5
4  2004-03        4

In [2]:
df.shape

(210, 2)

Check whether a column is duplicated or not.

In [3]:
df.duplicated()

0      False
1       True
2       True
3      False
4      False
       ...
205    False
206    False
207    False
208    False
209    False
Length: 210, dtype: bool

Count duplicates

In [4]:
df.duplicated().sum()

6

Drop duplicates

In [5]:
df1 = df.drop_duplicates()

In [6]:
df1.shape

(204, 2)

In [7]:
df1.head()

      Mese  Cupcake
0  2004-01        5
3  2004-02        5
4  2004-03        4
5  2004-04        6
6  2004-05        5

Drop also the first duplicate

In [8]:
df2 = df.drop_duplicates(keep=False)
df2.head()

      Mese  Cupcake
3  2004-02        5
4  2004-03        4
5  2004-04        6
6  2004-05        5
7  2004-06        6

In [9]:
df2.shape

(201, 2)

Drop duplicates on the basis of a subset of columns

In [10]:
df3 = df.drop_duplicates(subset=["Cupcake"])
df3.shape

(78, 2)

In [11]:
df3.head()

       Mese  Cupcake
0   2004-01        5
4   2004-03        4
5   2004-04        6
11  2004-10       10
12  2004-11        7